[Killed] BlockStatement
src/domain/entities/property.ts:43:42
     }
 
     validateGuestCount(guestCount: number): void {
-        if (guestCount > this.maxGuests) {
-            throw new Error(`Number of guests exceeded. Maximum allowed: ${this.maxGuests}`)
-        }
+        if (guestCount > this.maxGuests) {}
     }
 
killedBy: Booking entity unit tests should throw an error when booking if guest count exceeds the maximum allowed
statusReason: Error: expect(received).toThrow(expected)

Expected substring: "Number of guests exceeded. Maximum allowed: 5"

Received function did not throw

[Killed] BlockStatement
src/domain/entities/property.ts:51:30
     calculateTotalPrice(dateRange: DateRange): number {
         const totalNights = dateRange.getTotalNights();
         let totalPrice = totalNights * this.basePricePerNight;
-        if (totalNights < 7) {
-            return totalPrice;
-        }
+        if (totalNights < 7) {}
         return totalPrice * 0.9;
     }
killedBy: TypeORMBookingRepository should save a booking
statusReason: error: the database system is starting up
