[Killed] BlockStatement
src/application/services/property_service.ts:9:69
 export class PropertyService {
     constructor(private readonly propertyRepository: PropertyRepository) {}
 
-    async createProperty(dto: CreatePropertyDTO): Promise<Property> {
-        const property = new Property(
-            uuidv4(),
-            dto.name,
-            dto.description,
-            dto.maxGuests,
-            dto.basePricePerNight
-        );
-        if (!property.getName()) {
-            throw new Error('Property name is required');
-        }
-
-        await this.propertyRepository.save(property);
-        return property;
-    }
+    async createProperty(dto: CreatePropertyDTO): Promise<Property> {}
 
     async findPropertyById(id: string): Promise<Property | null> {
killedBy: PropertyController should create a property successfully
statusReason: Error: expect(received).toBe(expected) // Object.is equality

Expected: 201
Received: 400

[Killed] ConditionalExpression
src/application/services/property_service.ts:17:13
             dto.maxGuests,
             dto.basePricePerNight
         );
-        if (!property.getName()) {
+        if (true) {
             throw new Error('Property name is required');
         }
killedBy: PropertyController should create a property successfully
statusReason: Error: expect(received).toBe(expected) // Object.is equality

Expected: 201
Received: 400

[Killed] BooleanLiteral
src/application/services/property_service.ts:17:13
             dto.maxGuests,
             dto.basePricePerNight
         );
-        if (!property.getName()) {
+        if (property.getName()) {
             throw new Error('Property name is required');
         }
killedBy: PropertyController should create a property successfully
statusReason: Error: expect(received).toBe(expected) // Object.is equality

Expected: 201
Received: 400

[Killed] BlockStatement
src/application/services/property_service.ts:25:66
         return property;
     }
 
-    async findPropertyById(id: string): Promise<Property | null> {
-        return this.propertyRepository.findById(id);
-    }
+    async findPropertyById(id: string): Promise<Property | null> {}
 }
killedBy: BookingController should create a booking successfully
statusReason: Error: expect(received).toBe(expected) // Object.is equality

Expected: 201
Received: 400
