[Killed] BlockStatement
src/application/services/user_service.ts:9:57
 export class UserService {
     constructor(private readonly userRepository: UserRepository) {}
     
-    async createUser(dto: CreateUserDTO): Promise<User> {
-        const user = new User(uuidv4(), dto.name);
-        if (!user.getName()) {
-            throw new Error('User name is required');
-        }
-        await this.userRepository.save(user);
-        return user;
-    }
+    async createUser(dto: CreateUserDTO): Promise<User> {}
     
     async findUserById(id: string): Promise<User | null> {
killedBy: UserController should create a user successfully
statusReason: Error: expect(received).toBe(expected) // Object.is equality

Expected: 201
Received: 400

[Killed] ConditionalExpression
src/application/services/user_service.ts:11:13
     
     async createUser(dto: CreateUserDTO): Promise<User> {
         const user = new User(uuidv4(), dto.name);
-        if (!user.getName()) {
+        if (true) {
             throw new Error('User name is required');
         }
killedBy: UserController should create a user successfully
statusReason: Error: expect(received).toBe(expected) // Object.is equality

Expected: 201
Received: 400

[Killed] BooleanLiteral
src/application/services/user_service.ts:11:13
     
     async createUser(dto: CreateUserDTO): Promise<User> {
         const user = new User(uuidv4(), dto.name);
-        if (!user.getName()) {
+        if (user.getName()) {
             throw new Error('User name is required');
         }
killedBy: UserController should create a user successfully
statusReason: Error: expect(received).toBe(expected) // Object.is equality

Expected: 201
Received: 400

[NoCoverage] StringLiteral
src/application/services/user_service.ts:12:29
     async createUser(dto: CreateUserDTO): Promise<User> {
         const user = new User(uuidv4(), dto.name);
         if (!user.getName()) {
-            throw new Error('User name is required');
+            throw new Error("");
         }
         await this.userRepository.save(user);

[Killed] BlockStatement
src/application/services/user_service.ts:18:58
         return user;
     }
     
-    async findUserById(id: string): Promise<User | null> {
-        return this.userRepository.findById(id);
-    }
+    async findUserById(id: string): Promise<User | null> {}
 }
killedBy: BookingController should create a booking successfully
statusReason: Error: expect(received).toBe(expected) // Object.is equality

Expected: 201
Received: 400
