[Killed] ConditionalExpression
src/infrastructure/web/booking_controller.ts:17:17
             const startDate = new Date(req.body.startDate);
             const endDate = new Date(req.body.endDate);
 
-            if (isNaN(startDate.getTime()) || isNaN(endDate.getTime())) {
+            if (false) {
                 return res.status(400).json({ error: 'Invalid start/end date format'});
             }
killedBy: BookingController should return 400 for invalid start date format
statusReason: Error: expect(received).toBe(expected) // Object.is equality

Expected: "Invalid start/end date format"
Received: "invalid input syntax for type timestamp: \"0NaN-NaN-NaNTNaN:NaN:NaN.NaN+NaN:NaN\""

[Killed] ConditionalExpression
src/infrastructure/web/booking_controller.ts:17:17
             const startDate = new Date(req.body.startDate);
             const endDate = new Date(req.body.endDate);
 
-            if (isNaN(startDate.getTime()) || isNaN(endDate.getTime())) {
+            if (true) {
                 return res.status(400).json({ error: 'Invalid start/end date format'});
             }
killedBy: BookingController should create a booking successfully
statusReason: Error: expect(received).toBe(expected) // Object.is equality

Expected: 201
Received: 400

[Killed] ObjectLiteral
src/infrastructure/web/booking_controller.ts:18:45
             const endDate = new Date(req.body.endDate);
 
             if (isNaN(startDate.getTime()) || isNaN(endDate.getTime())) {
-                return res.status(400).json({ error: 'Invalid start/end date format'});
+                return res.status(400).json({});
             }
 
killedBy: BookingController should return 400 for invalid start date format
statusReason: Error: expect(received).toBe(expected) // Object.is equality

Expected: "Invalid start/end date format"
Received: undefined

[Killed] ObjectLiteral
src/infrastructure/web/booking_controller.ts:21:43
                 return res.status(400).json({ error: 'Invalid start/end date format'});
             }
 
-            const dto: CreateBookingDTO = {
-                propertyId: req.body.propertyId,
-                guestId: req.body.userId,
-                startDate: startDate,
-                endDate: endDate,
-                guestCount: req.body.guestCount,
-            }
+            const dto: CreateBookingDTO = {}
 
             const booking = await this.bookingService.createBooking(dto);
killedBy: BookingController should create a booking successfully
statusReason: Error: expect(received).toBe(expected) // Object.is equality

Expected: 201
Received: 400

[Killed] StringLiteral
src/infrastructure/web/booking_controller.ts:32:26
             const booking = await this.bookingService.createBooking(dto);
 
             return res.status(201).json({
-                message: 'Booking created successfully',
+                message: "",
                 booking: {
                     id: booking.getId(),
killedBy: BookingController should create a booking successfully
statusReason: Error: expect(received).toBe(expected) // Object.is equality

Expected: "Booking created successfully"
Received: ""

[Killed] ObjectLiteral
src/infrastructure/web/booking_controller.ts:33:26
 
             return res.status(201).json({
                 message: 'Booking created successfully',
-                booking: {
-                    id: booking.getId(),
-                    propertyId: booking.getProperty().getId(),
-                    guestId: booking.getGuest().getId(),
-                    startDate: booking.getDateRange().getStartDate(),
-                    endDate: booking.getDateRange().getEndDate(),
-                    guestCount: booking.getGuestCount(),
-                    totalPrice: booking.getTotalPrice(),
-                    status: booking.getStatus(),
-                }
+                booking: {}
             });
         } catch (error: any) {
killedBy: BookingController should create a booking successfully
statusReason: error: the database system is starting up

[Timeout] BlockStatement
src/infrastructure/web/booking_controller.ts:44:30
                     status: booking.getStatus(),
                 }
             });
-        } catch (error: any) {
-            return res.status(400).json({ error: error.message || 'An unexpected error occurred' });
-        }
+        } catch (error: any) {}
     }
 

[Killed] ConditionalExpression
src/infrastructure/web/booking_controller.ts:45:50
                 }
             });
         } catch (error: any) {
-            return res.status(400).json({ error: error.message || 'An unexpected error occurred' });
+            return res.status(400).json({ error: false });
         }
     }
killedBy: BookingController should return 400 for a guest number less than 1
statusReason: Error: expect(received).toBe(expected) // Object.is equality

Expected: "The number of guests must be greater than zero"
Received: false

[Killed] LogicalOperator
src/infrastructure/web/booking_controller.ts:45:50
                 }
             });
         } catch (error: any) {
-            return res.status(400).json({ error: error.message || 'An unexpected error occurred' });
+            return res.status(400).json({ error: error.message && 'An unexpected error occurred' });
         }
     }
killedBy: BookingController should return 400 for a guest number less than 1
statusReason: Error: expect(received).toBe(expected) // Object.is equality

Expected: "The number of guests must be greater than zero"
Received: "An unexpected error occurred"

[Timeout] BlockStatement
src/infrastructure/web/booking_controller.ts:49:73
         }
     }
 
-    async cancelBooking(req: Request, res: Response): Promise<Response> {   
-        try {
-            const bookingId = req.params.id;
-            await this.bookingService.cancelBooking(bookingId);
-
-            return res.status(200).json({ message: 'Booking canceled successfully' });
-        } catch (error: any) {
-            return res.status(400).json({ error: error.message || 'An unexpected error occurred' });
-        }
-    }
+    async cancelBooking(req: Request, res: Response): Promise<Response> {}
 }

[Timeout] BlockStatement
src/infrastructure/web/booking_controller.ts:50:13
     }
 
     async cancelBooking(req: Request, res: Response): Promise<Response> {   
-        try {
-            const bookingId = req.params.id;
-            await this.bookingService.cancelBooking(bookingId);
-
-            return res.status(200).json({ message: 'Booking canceled successfully' });
-        } catch (error: any) {
+        try {} catch (error: any) {
             return res.status(400).json({ error: error.message || 'An unexpected error occurred' });
         }

[Killed] BlockStatement
src/infrastructure/web/booking_controller.ts:55:30
             await this.bookingService.cancelBooking(bookingId);
 
             return res.status(200).json({ message: 'Booking canceled successfully' });
-        } catch (error: any) {
-            return res.status(400).json({ error: error.message || 'An unexpected error occurred' });
-        }
+        } catch (error: any) {}
     }
 }
killedBy: BookingController should return 400 for canceling a non-existent booking
statusReason: Error: thrown: "Exceeded timeout of 20000 ms for a test.
Add a timeout value to this test to increase the timeout, if this is a long-running test. See https://jestjs.io/docs/api#testname-fn-timeout."

[Killed] ConditionalExpression
src/infrastructure/web/booking_controller.ts:56:50
 
             return res.status(200).json({ message: 'Booking canceled successfully' });
         } catch (error: any) {
-            return res.status(400).json({ error: error.message || 'An unexpected error occurred' });
+            return res.status(400).json({ error: true });
         }
     }
killedBy: BookingController should return 400 for canceling a non-existent booking
statusReason: Error: expect(received).toBe(expected) // Object.is equality

Expected: "Booking not found"
Received: true
