[Timeout] BlockStatement
src/infrastructure/web/property_controller.ts:14:13
     }
 
     async createProperty(req: Request, res: Response): Promise<Response> {
-        try {
-            const dto: CreatePropertyDTO = {
-                name: req.body.name,
-                description: req.body.description,
-                maxGuests: req.body.maxGuests,
-                basePricePerNight: req.body.basePricePerNight,
-            }
-
-            if (!dto.basePricePerNight) {
-                throw new Error('The base price per night is required');
-            }
-
-            const property = await this.propertyService.createProperty(dto);
-            return res.status(201).json({
-                message: 'Property created successfully',
-                property: {
-                    id: property.getId(),
-                    name: property.getName(),
-                    description: property.getDescription(),
-                    maxGuests: property.getMaxGuests(),
-                    basePricePerNight: property.getBasePricePerNight(),
-                }
-            });
-        } catch (error: any) {
+        try {} catch (error: any) {
             return res.status(400).json({ error: error.message || 'An unexpected error occurred' });
         }

[Killed] ObjectLiteral
src/infrastructure/web/property_controller.ts:15:44
 
     async createProperty(req: Request, res: Response): Promise<Response> {
         try {
-            const dto: CreatePropertyDTO = {
-                name: req.body.name,
-                description: req.body.description,
-                maxGuests: req.body.maxGuests,
-                basePricePerNight: req.body.basePricePerNight,
-            }
+            const dto: CreatePropertyDTO = {}
 
             if (!dto.basePricePerNight) {
killedBy: PropertyController should create a property successfully
statusReason: error: the database system is starting up

[Killed] BlockStatement
src/infrastructure/web/property_controller.ts:22:41
                 basePricePerNight: req.body.basePricePerNight,
             }
 
-            if (!dto.basePricePerNight) {
-                throw new Error('The base price per night is required');
-            }
+            if (!dto.basePricePerNight) {}
 
             const property = await this.propertyService.createProperty(dto);
killedBy: PropertyController should return an error is basePricePerNight is missing
statusReason: Error: expect(received).toBe(expected) // Object.is equality

Expected: "The base price per night is required"
Received: "null value in column \"base_price_per_night\" of relation \"properties\" violates not-null constraint"

[Killed] ConditionalExpression
src/infrastructure/web/property_controller.ts:22:17
                 basePricePerNight: req.body.basePricePerNight,
             }
 
-            if (!dto.basePricePerNight) {
+            if (false) {
                 throw new Error('The base price per night is required');
             }
killedBy: PropertyController should return an error is basePricePerNight is missing
statusReason: Error: expect(received).toBe(expected) // Object.is equality

Expected: "The base price per night is required"
Received: "null value in column \"base_price_per_night\" of relation \"properties\" violates not-null constraint"

[Killed] ObjectLiteral
src/infrastructure/web/property_controller.ts:29:27
             const property = await this.propertyService.createProperty(dto);
             return res.status(201).json({
                 message: 'Property created successfully',
-                property: {
-                    id: property.getId(),
-                    name: property.getName(),
-                    description: property.getDescription(),
-                    maxGuests: property.getMaxGuests(),
-                    basePricePerNight: property.getBasePricePerNight(),
-                }
+                property: {}
             });
         } catch (error: any) {
killedBy: PropertyController should create a property successfully
statusReason: Error: expect(received).toHaveProperty(path)

Expected path: "id"
Received path: []

Received value: {}
