[Killed] BlockStatement
src/infrastructure/web/user_controller.ts:8:51
 export class UserController {
     constructor(private userService: UserService) {}
 
-    async createUser(req: Request, res: Response) {
-        try{
-            const dto: CreateUserDTO = {
-                name: req.body.name,
-            };
-
-            const user = await this.userService.createUser(dto);
-            return res.status(201).json({
-                message: 'User created successfully',
-                user: {
-                    id: user.getId(),
-                    name: user.getName(),
-                }
-            });
-        } catch (error: any) {
-            return res.status(400).json({ error: error.message || 'An unexpected error occurred' });
-        }
-    }
+    async createUser(req: Request, res: Response) {}
 }
killedBy: UserController should create a user successfully
statusReason: error: the database system is starting up

[Timeout] BlockStatement
src/infrastructure/web/user_controller.ts:9:12
     constructor(private userService: UserService) {}
 
     async createUser(req: Request, res: Response) {
-        try{
-            const dto: CreateUserDTO = {
-                name: req.body.name,
-            };
-
-            const user = await this.userService.createUser(dto);
-            return res.status(201).json({
-                message: 'User created successfully',
-                user: {
-                    id: user.getId(),
-                    name: user.getName(),
-                }
-            });
-        } catch (error: any) {
+        try{} catch (error: any) {
             return res.status(400).json({ error: error.message || 'An unexpected error occurred' });
         }
