[Killed] BlockStatement
src/infrastructure/repositories/typeorm_booking_repository.ts:14:49
         this.repository = repository;
     }
 
-    async save(booking: Booking): Promise<void> {
-        const bookingEntity = BookingMapper.toPersistence(booking);
-        await this.repository.save(bookingEntity);
-    }
+    async save(booking: Booking): Promise<void> {}
     async findById(id: string): Promise<Booking | null> {
         const bookingEntity = await this.repository.findOne({
killedBy: BookingController should cancel a booking successfully
statusReason: Error: expect(received).toBe(expected) // Object.is equality

Expected: 200
Received: 400

[Killed] BlockStatement
src/infrastructure/repositories/typeorm_booking_repository.ts:18:57
         const bookingEntity = BookingMapper.toPersistence(booking);
         await this.repository.save(bookingEntity);
     }
-    async findById(id: string): Promise<Booking | null> {
-        const bookingEntity = await this.repository.findOne({
-            where: { id },
-            relations: ['property', 'guest']
-        });
-        return bookingEntity ? BookingMapper.toDomain(bookingEntity) : null;
-    }
+    async findById(id: string): Promise<Booking | null> {}
 }
killedBy: BookingController should cancel a booking successfully
statusReason: Error: expect(received).toBe(expected) // Object.is equality

Expected: 200
Received: 400

[Killed] ObjectLiteral
src/infrastructure/repositories/typeorm_booking_repository.ts:20:20
     }
     async findById(id: string): Promise<Booking | null> {
         const bookingEntity = await this.repository.findOne({
-            where: { id },
+            where: {},
             relations: ['property', 'guest']
         });
killedBy: BookingController should cancel a booking successfully
statusReason: error: the database system is starting up

[Killed] StringLiteral
src/infrastructure/repositories/typeorm_booking_repository.ts:21:37
     async findById(id: string): Promise<Booking | null> {
         const bookingEntity = await this.repository.findOne({
             where: { id },
-            relations: ['property', 'guest']
+            relations: ['property', ""]
         });
         return bookingEntity ? BookingMapper.toDomain(bookingEntity) : null;
killedBy: BookingController should cancel a booking successfully
statusReason: Error: expect(received).toBe(expected) // Object.is equality

Expected: 200
Received: 400

[Killed] StringLiteral
src/infrastructure/repositories/typeorm_booking_repository.ts:21:25
     async findById(id: string): Promise<Booking | null> {
         const bookingEntity = await this.repository.findOne({
             where: { id },
-            relations: ['property', 'guest']
+            relations: ["", 'guest']
         });
         return bookingEntity ? BookingMapper.toDomain(bookingEntity) : null;
killedBy: BookingController should cancel a booking successfully
statusReason: Error: expect(received).toBe(expected) // Object.is equality

Expected: 200
Received: 400
