[Killed] BlockStatement
src/infrastructure/repositories/typeorm_property_repository.ts:14:51
         this.repository = repository;
     }
 
-    async save(property: Property): Promise<void> {
-        const propertyEntity = PropertyMapper.toPersistence(property);
-        await this.repository.save(propertyEntity);
-    }
+    async save(property: Property): Promise<void> {}
 
     async findById(id: string): Promise<Property | null> {
killedBy: TypeORMPropertyRepository should save a property
statusReason: Error: expect(received).toBe(expected) // Object.is equality

Expected: "fb0b5a41-fb93-4dfc-8e53-cb94662082d9"
Received: undefined

[Killed] BlockStatement
src/infrastructure/repositories/typeorm_property_repository.ts:19:58
         await this.repository.save(propertyEntity);
     }
 
-    async findById(id: string): Promise<Property | null> {
-        const propertyEntity = await this.repository.findOne({ where: { id } });
-        return propertyEntity ? PropertyMapper.toDomain(propertyEntity) : null;
-    }
+    async findById(id: string): Promise<Property | null> {}
 }
killedBy: BookingController should create a booking successfully
statusReason: Error: expect(received).toBe(expected) // Object.is equality

Expected: 201
Received: 400

[Killed] ObjectLiteral
src/infrastructure/repositories/typeorm_property_repository.ts:20:62
     }
 
     async findById(id: string): Promise<Property | null> {
-        const propertyEntity = await this.repository.findOne({ where: { id } });
+        const propertyEntity = await this.repository.findOne({});
         return propertyEntity ? PropertyMapper.toDomain(propertyEntity) : null;
     }
killedBy: BookingController should create a booking successfully
statusReason: Error: expect(received).toBe(expected) // Object.is equality

Expected: 201
Received: 400
