[Killed] BlockStatement
src/infrastructure/repositories/typeorm_user_repository.ts:14:43
         this.repository = repository;
     }
 
-    async save(user: User): Promise<void> {
-        const userEntity = UserMapper.toPersistence(user);
-        await this.repository.save(userEntity);
-    }
+    async save(user: User): Promise<void> {}
 
     async findById(id: string): Promise<User | null> {
killedBy: TypeORMUserRepository should save a user
statusReason: Error: expect(received).not.toBeNull()

Received: null

[Killed] BlockStatement
src/infrastructure/repositories/typeorm_user_repository.ts:19:54
         await this.repository.save(userEntity);
     }
 
-    async findById(id: string): Promise<User | null> {
-        const userEntity = await this.repository.findOne({ where: { id } });
-        return userEntity ? UserMapper.toDomain(userEntity) : null;
-    }
+    async findById(id: string): Promise<User | null> {}
 }
killedBy: BookingController should create a booking successfully
statusReason: Error: expect(received).toBe(expected) // Object.is equality

Expected: 201
Received: 400
