[Killed] BlockStatement
src/application/services/booking_service.ts:16:66
         private readonly userService: UserService,
         private readonly dateRangeFactory: DateRangeFactory
     ) {}
-    async createBooking(dto: CreateBookingDTO): Promise<Booking> {
-        const property = await this.propertyService.findPropertyById(dto.propertyId);
-        if (!property) {
-            throw new Error('Property not found');
-        }
-        const guest = await this.userService.findUserById(dto.guestId);
-        if (!guest) {
-            throw new Error('User not found');
-        }
-        const dateRange = this.dateRangeFactory.create(dto.startDate, dto.endDate);
-
-        const booking = new Booking(
-            uuidv4(),
-            property,
-            guest,
-            dateRange,
-            dto.guestCount
-        );
-
-        await this.bookingRepository.save(booking);
-
-        return booking;
-    }
+    async createBooking(dto: CreateBookingDTO): Promise<Booking> {}
 
     async cancelBooking(bookingId: string): Promise<void> {
killedBy: BookingController should create a booking successfully
statusReason: Error: expect(received).toBe(expected) // Object.is equality

Expected: 201
Received: 400

[Killed] BooleanLiteral
src/application/services/booking_service.ts:18:13
     ) {}
     async createBooking(dto: CreateBookingDTO): Promise<Booking> {
         const property = await this.propertyService.findPropertyById(dto.propertyId);
-        if (!property) {
+        if (property) {
             throw new Error('Property not found');
         }
killedBy: BookingController should create a booking successfully
statusReason: Error: expect(received).toBe(expected) // Object.is equality

Expected: 201
Received: 400

[Killed] ConditionalExpression
src/application/services/booking_service.ts:18:13
     ) {}
     async createBooking(dto: CreateBookingDTO): Promise<Booking> {
         const property = await this.propertyService.findPropertyById(dto.propertyId);
-        if (!property) {
+        if (true) {
             throw new Error('Property not found');
         }
killedBy: BookingController should create a booking successfully
statusReason: Error: expect(received).toBe(expected) // Object.is equality

Expected: 201
Received: 400

[Killed] BooleanLiteral
src/application/services/booking_service.ts:22:13
             throw new Error('Property not found');
         }
         const guest = await this.userService.findUserById(dto.guestId);
-        if (!guest) {
+        if (guest) {
             throw new Error('User not found');
         }
killedBy: BookingController should create a booking successfully
statusReason: error: the database system is starting up

[Killed] BlockStatement
src/application/services/booking_service.ts:22:21
             throw new Error('Property not found');
         }
         const guest = await this.userService.findUserById(dto.guestId);
-        if (!guest) {
-            throw new Error('User not found');
-        }
+        if (!guest) {}
         const dateRange = this.dateRangeFactory.create(dto.startDate, dto.endDate);
 
killedBy: BookingService should throw an error when the user is not found
statusReason: Error: expect(received).rejects.toThrow(expected)

Expected substring: "User not found"
Received message:   "property.calculateTotalPrice is not a function"

      68 |       this.dateRange = dateRange;
      69 |       this.guestCount = guestCount;
    > 70 |       this.totalPrice = property.calculateTotalPrice(dateRange);

[Killed] BlockStatement
src/application/services/booking_service.ts:40:59
         return booking;
     }
 
-    async cancelBooking(bookingId: string): Promise<void> {
-        const booking = await this.bookingRepository.findById(bookingId);
-
-        if (!booking) {
-            throw new Error('Booking not found');
-        }
-        
-        booking?.cancel(new Date());
-        await this.bookingRepository.save(booking!);
-    }
+    async cancelBooking(bookingId: string): Promise<void> {}
 }
killedBy: BookingController should return 400 for canceling a non-existent booking
statusReason: Error: expect(received).toBe(expected) // Object.is equality

Expected: 400
Received: 200

[Killed] BooleanLiteral
src/application/services/booking_service.ts:43:13
     async cancelBooking(bookingId: string): Promise<void> {
         const booking = await this.bookingRepository.findById(bookingId);
 
-        if (!booking) {
+        if (booking) {
             throw new Error('Booking not found');
         }
killedBy: BookingController should cancel a booking successfully
statusReason: Error: expect(received).toBe(expected) // Object.is equality

Expected: 200
Received: 400

[Killed] ConditionalExpression
src/application/services/booking_service.ts:43:13
     async cancelBooking(bookingId: string): Promise<void> {
         const booking = await this.bookingRepository.findById(bookingId);
 
-        if (!booking) {
+        if (false) {
             throw new Error('Booking not found');
         }
killedBy: BookingController should return 400 for canceling a non-existent booking
statusReason: Error: expect(received).toBe(expected) // Object.is equality

Expected: "Booking not found"
Received: "Cannot read properties of null (reading 'getId')"

[Survived] OptionalChaining
src/application/services/booking_service.ts:47:9
             throw new Error('Booking not found');
         }
         
-        booking?.cancel(new Date());
+        booking.cancel(new Date());
         await this.bookingRepository.save(booking!);
     }
