[Killed] BlockStatement
src/application/factories/date_range_factory.ts:4:47
 import { DateRange } from "../../domain/value_objects/date_range";
 
 export class DateRangeFactory {
-    create(start: Date, end: Date): DateRange {
-        return new DateRange(start, end);
-    }
+    create(start: Date, end: Date): DateRange {}
 }
killedBy: BookingController should create a booking successfully
statusReason: Error: expect(received).toBe(expected) // Object.is equality

Expected: 201
Received: 400
