[Killed] BlockStatement
src/domain/cancelation/full_refund.ts:4:49
 import { RefundRule } from "./refund_rule.interface";
 
 export class FullRefund implements RefundRule {
-    claculateRefund(totalPrice: number): number {
-        return 0;
-    }
+    claculateRefund(totalPrice: number): number {}
 }
killedBy: Booking entity unit tests should cancel a booking with full reimbursement when there is more than seven days before check-in
statusReason: Error: expect(received).toBe(expected) // Object.is equality

Expected: 0
Received: undefined
