[Killed] BlockStatement
src/domain/cancelation/no_refund.ts:4:49
 import { RefundRule } from "./refund_rule.interface";
 
 export class NoRefund implements RefundRule {
-    claculateRefund(totalPrice: number): number {
-        return totalPrice;
-    }
+    claculateRefund(totalPrice: number): number {}
 }
killedBy: Booking entity unit tests should cancel a booking without reimbursement when there is less than one day left before check-in
statusReason: Error: expect(received).toBe(expected) // Object.is equality

Expected: 600
Received: undefined
