[Killed] BlockStatement
src/domain/cancelation/partial_refund.ts:4:49
 import { RefundRule } from "./refund_rule.interface";
 
 export class PartialRefund implements RefundRule {
-    claculateRefund(totalPrice: number): number {
-        return totalPrice * 0.5;
-    }
+    claculateRefund(totalPrice: number): number {}
 }
killedBy: Booking entity unit tests should cancel a booking with partial reimbursement when there is between one to seven days before check-in
statusReason: Error: expect(received).toBe(expected) // Object.is equality

Expected: 750
Received: undefined

[Killed] ArithmeticOperator
src/domain/cancelation/partial_refund.ts:5:16
 
 export class PartialRefund implements RefundRule {
     claculateRefund(totalPrice: number): number {
-        return totalPrice * 0.5;
+        return totalPrice / 0.5;
     }
 }
killedBy: TypeORMBookingRepository should save a booking and then canceling
statusReason: error: the database system is starting up
