[Killed] BlockStatement
src/domain/cancelation/refund_rule_factory.ts:7:64
 import { RefundRule } from "./refund_rule.interface";
 
 export class RefundRuleFactory {
-    static getRefundRule(daysUntilCheckIn: number): RefundRule {
-        if (daysUntilCheckIn > 7) {
-            return new FullRefund();
-        } else if (daysUntilCheckIn >= 1) {
-            return new PartialRefund();
-        }
-        return new NoRefund();
-    }
+    static getRefundRule(daysUntilCheckIn: number): RefundRule {}
 }
killedBy: BookingController should cancel a booking successfully
statusReason: Error: expect(received).toBe(expected) // Object.is equality

Expected: 200
Received: 400

[Killed] ConditionalExpression
src/domain/cancelation/refund_rule_factory.ts:8:13
 
 export class RefundRuleFactory {
     static getRefundRule(daysUntilCheckIn: number): RefundRule {
-        if (daysUntilCheckIn > 7) {
+        if (false) {
             return new FullRefund();
         } else if (daysUntilCheckIn >= 1) {
killedBy: Booking entity unit tests should cancel a booking with full reimbursement when there is more than seven days before check-in
statusReason: Error: expect(received).toBe(expected) // Object.is equality

Expected: 0
Received: 750

[Killed] EqualityOperator
src/domain/cancelation/refund_rule_factory.ts:8:13
 
 export class RefundRuleFactory {
     static getRefundRule(daysUntilCheckIn: number): RefundRule {
-        if (daysUntilCheckIn > 7) {
+        if (daysUntilCheckIn <= 7) {
             return new FullRefund();
         } else if (daysUntilCheckIn >= 1) {
killedBy: Booking entity unit tests should cancel a booking without reimbursement when there is less than one day left before check-in
statusReason: Error: expect(received).toBe(expected) // Object.is equality

Expected: 600
Received: 0

[Killed] EqualityOperator
src/domain/cancelation/refund_rule_factory.ts:10:20
     static getRefundRule(daysUntilCheckIn: number): RefundRule {
         if (daysUntilCheckIn > 7) {
             return new FullRefund();
-        } else if (daysUntilCheckIn >= 1) {
+        } else if (daysUntilCheckIn > 1) {
             return new PartialRefund();
         }
killedBy: RefundRuleFactory should return PartialRefund when daysUntilCheckIn between 1 and 7
statusReason: Error: expect(received).toBeInstanceOf(expected)

Expected constructor: PartialRefund
Received constructor: NoRefund

[Killed] EqualityOperator
src/domain/cancelation/refund_rule_factory.ts:10:20
     static getRefundRule(daysUntilCheckIn: number): RefundRule {
         if (daysUntilCheckIn > 7) {
             return new FullRefund();
-        } else if (daysUntilCheckIn >= 1) {
+        } else if (daysUntilCheckIn < 1) {
             return new PartialRefund();
         }
killedBy: Booking entity unit tests should cancel a booking without reimbursement when there is less than one day left before check-in
statusReason: Error: expect(received).toBe(expected) // Object.is equality

Expected: 600
Received: 300
