[Killed] BlockStatement
src/domain/entities/booking.ts:21:7
         guest: User,
         dateRange: DateRange,
         guestCount: number
-    ) {
-        this.id = id;
-        this.property = property;
-        this.guest = guest;
-        this.dateRange = dateRange;
-        this.guestCount = guestCount;
-        this.totalPrice = property.calculateTotalPrice(dateRange);
-        this.status = 'CONFIRMED';
-        this.validate();
-
-        property.addBooking(this);
-    }
+    ) {}
 
     getId(): string {
killedBy: TypeORMBookingRepository should save a booking
statusReason: TypeError: Cannot read properties of undefined (reading 'getId')

[Killed] StringLiteral
src/domain/entities/booking.ts:28:23
         this.dateRange = dateRange;
         this.guestCount = guestCount;
         this.totalPrice = property.calculateTotalPrice(dateRange);
-        this.status = 'CONFIRMED';
+        this.status = "";
         this.validate();
 
killedBy: Booking entity unit tests should not book when a property is unavailable
statusReason: Error: expect(received).toThrow(expected)

Expected substring: "The property is unavailable in the date range requested"

Received function did not throw

[Killed] BlockStatement
src/domain/entities/booking.ts:34:21
         property.addBooking(this);
     }
 
-    getId(): string {
-        return this.id;
-    }
+    getId(): string {}
 
     getProperty(): Property {
killedBy: Booking entity unit tests should instantiate a booking with all attributes
statusReason: Error: expect(received).toBe(expected) // Object.is equality

Expected: "1"
Received: undefined

[Killed] BlockStatement
src/domain/entities/booking.ts:38:29
         return this.id;
     }
 
-    getProperty(): Property {
-        return this.property;
-    }
+    getProperty(): Property {}
 
     getGuest(): User {
killedBy: Booking entity unit tests should instantiate a booking with all attributes
statusReason: Error: expect(received).toBe(expected) // Object.is equality

Received: undefined

[Killed] BlockStatement
src/domain/entities/booking.ts:42:22
         return this.property;
     }
 
-    getGuest(): User {
-        return this.guest;
-    }
+    getGuest(): User {}
 
     getUser(): User {
killedBy: BookingController should create a booking successfully
statusReason: TypeError: Cannot read properties of undefined (reading 'getId')

[Killed] BlockStatement
src/domain/entities/booking.ts:46:21
         return this.guest;
     }
 
-    getUser(): User {
-        return this.guest;
-    }
+    getUser(): User {}
 
     getDateRange(): DateRange {
killedBy: Booking entity unit tests should instantiate a booking with all attributes
statusReason: Error: expect(received).toBe(expected) // Object.is equality

Expected: {"id": "1", "name": "Jhon Doe"}
Received: undefined

[Killed] BlockStatement
src/domain/entities/booking.ts:50:31
         return this.guest;
     }
 
-    getDateRange(): DateRange {
-        return this.dateRange;
-    }
+    getDateRange(): DateRange {}
 
     getGuestCount(): number {
killedBy: BookingController should create a booking successfully
statusReason: TypeError: Cannot read properties of undefined (reading 'getStartDate')

[Killed] BlockStatement
src/domain/entities/booking.ts:54:29
         return this.dateRange;
     }
 
-    getGuestCount(): number {
-        return this.guestCount;
-    }
+    getGuestCount(): number {}
 
     getStatus(): 'CONFIRMED' | 'CANCELLED' {
killedBy: BookingController should create a booking successfully
statusReason: Error: expect(received).toBe(expected) // Object.is equality

Expected: 201
Received: 400

[Killed] BlockStatement
src/domain/entities/booking.ts:58:44
         return this.guestCount;
     }
 
-    getStatus(): 'CONFIRMED' | 'CANCELLED' {
-        return this.status;
-    }
+    getStatus(): 'CONFIRMED' | 'CANCELLED' {}
 
     getTotalPrice(): number {
killedBy: Booking entity unit tests should not book when a property is unavailable
statusReason: Error: expect(received).toThrow(expected)

Expected substring: "The property is unavailable in the date range requested"

Received function did not throw

[Killed] BlockStatement
src/domain/entities/booking.ts:62:29
         return this.status;
     }
 
-    getTotalPrice(): number {
-        return this.totalPrice;
-    }
+    getTotalPrice(): number {}
 
     cancel(currentDate: Date): void {
killedBy: Booking entity unit tests should calculate the total price with discount
statusReason: Error: expect(received).toBe(expected) // Object.is equality

Expected: 2430
Received: undefined

[Killed] BlockStatement
src/domain/entities/booking.ts:66:37
         return this.totalPrice;
     }
 
-    cancel(currentDate: Date): void {
-        if (this.status === 'CANCELLED') {
-            throw new Error('This booking is already cancelled');
-        }
-        
-        const checkInDate = this.dateRange.getStartDate();
-        const timeDiff = checkInDate.getTime() - currentDate.getTime();
-        const daysUntilCheckIn = Math.ceil(timeDiff / (1000 * 3600 * 24));
-        
-        const refundRule = RefundRuleFactory.getRefundRule(daysUntilCheckIn);
-        this.totalPrice = refundRule.claculateRefund(this.totalPrice);
-        
-        this.status = 'CANCELLED';
-    }
+    cancel(currentDate: Date): void {}
 
     private validate(): void {
killedBy: TypeORMBookingRepository should save a booking and then canceling
statusReason: Error: expect(received).toBe(expected) // Object.is equality

Expected: "CANCELLED"
Received: "CONFIRMED"

[Killed] ConditionalExpression
src/domain/entities/booking.ts:67:13
     }
 
     cancel(currentDate: Date): void {
-        if (this.status === 'CANCELLED') {
+        if (true) {
             throw new Error('This booking is already cancelled');
         }
killedBy: TypeORMBookingRepository should save a booking and then canceling
statusReason: Error: This booking is already cancelled

[Killed] EqualityOperator
src/domain/entities/booking.ts:67:13
     }
 
     cancel(currentDate: Date): void {
-        if (this.status === 'CANCELLED') {
+        if (this.status !== 'CANCELLED') {
             throw new Error('This booking is already cancelled');
         }
killedBy: BookingController should cancel a booking successfully
statusReason: Error: expect(received).toBe(expected) // Object.is equality

Expected: 200
Received: 400

[Killed] ArithmeticOperator
src/domain/entities/booking.ts:72:26
         }
         
         const checkInDate = this.dateRange.getStartDate();
-        const timeDiff = checkInDate.getTime() - currentDate.getTime();
+        const timeDiff = checkInDate.getTime() + currentDate.getTime();
         const daysUntilCheckIn = Math.ceil(timeDiff / (1000 * 3600 * 24));
         
killedBy: TypeORMBookingRepository should save a booking and then canceling
statusReason: error: the database system is starting up

[Killed] ArithmeticOperator
src/domain/entities/booking.ts:73:56
         
         const checkInDate = this.dateRange.getStartDate();
         const timeDiff = checkInDate.getTime() - currentDate.getTime();
-        const daysUntilCheckIn = Math.ceil(timeDiff / (1000 * 3600 * 24));
+        const daysUntilCheckIn = Math.ceil(timeDiff / (1000 * 3600 / 24));
         
         const refundRule = RefundRuleFactory.getRefundRule(daysUntilCheckIn);
killedBy: TypeORMBookingRepository should save a booking and then canceling
statusReason: error: the database system is starting up

[Killed] ArithmeticOperator
src/domain/entities/booking.ts:73:56
         
         const checkInDate = this.dateRange.getStartDate();
         const timeDiff = checkInDate.getTime() - currentDate.getTime();
-        const daysUntilCheckIn = Math.ceil(timeDiff / (1000 * 3600 * 24));
+        const daysUntilCheckIn = Math.ceil(timeDiff / (1000 / 3600 * 24));
         
         const refundRule = RefundRuleFactory.getRefundRule(daysUntilCheckIn);
killedBy: Booking entity unit tests should cancel a booking with partial reimbursement when there is between one to seven days before check-in
statusReason: Error: expect(received).toBe(expected) // Object.is equality

Expected: 750
Received: 0

[Killed] BlockStatement
src/domain/entities/booking.ts:81:30
         this.status = 'CANCELLED';
     }
 
-    private validate(): void {
-        if (!this.id) {
-            throw new Error('Booking ID is required');
-        }
-        if (!this.guestCount || this.guestCount <= 0) {
-            throw new Error('The number of guests must be greater than zero');
-        }
-        this.property.validateGuestCount(this.guestCount);
-        if (!this.property.isAvailable(this.dateRange)) {
-            throw new Error('The property is unavailable in the date range requested');
-        }
-    }
+    private validate(): void {}
 }
killedBy: BookingMapper should throw a validation error when booking id is missing
statusReason: Error: expect(received).toThrow(expected)

Expected substring: "Booking ID is required"

Received function did not throw

[Killed] BooleanLiteral
src/domain/entities/booking.ts:82:13
     }
 
     private validate(): void {
-        if (!this.id) {
+        if (this.id) {
             throw new Error('Booking ID is required');
         }
killedBy: BookingController should create a booking successfully
statusReason: Error: Booking ID is required

[Killed] BlockStatement
src/domain/entities/booking.ts:82:23
     }
 
     private validate(): void {
-        if (!this.id) {
-            throw new Error('Booking ID is required');
-        }
+        if (!this.id) {}
         if (!this.guestCount || this.guestCount <= 0) {
             throw new Error('The number of guests must be greater than zero');
killedBy: BookingMapper should throw a validation error when booking id is missing
statusReason: Error: expect(received).toThrow(expected)

Expected substring: "Booking ID is required"

Received function did not throw

[Killed] ConditionalExpression
src/domain/entities/booking.ts:85:13
         if (!this.id) {
             throw new Error('Booking ID is required');
         }
-        if (!this.guestCount || this.guestCount <= 0) {
+        if (true) {
             throw new Error('The number of guests must be greater than zero');
         }
killedBy: BookingController should create a booking successfully
statusReason: Error: The number of guests must be greater than zero

[Killed] BooleanLiteral
src/domain/entities/booking.ts:85:13
         if (!this.id) {
             throw new Error('Booking ID is required');
         }
-        if (!this.guestCount || this.guestCount <= 0) {
+        if (this.guestCount || this.guestCount <= 0) {
             throw new Error('The number of guests must be greater than zero');
         }
killedBy: BookingController should create a booking successfully
statusReason: Error: The number of guests must be greater than zero

[Killed] StringLiteral
src/domain/entities/booking.ts:86:29
             throw new Error('Booking ID is required');
         }
         if (!this.guestCount || this.guestCount <= 0) {
-            throw new Error('The number of guests must be greater than zero');
+            throw new Error("");
         }
         this.property.validateGuestCount(this.guestCount);
killedBy: BookingController should return 400 for a guest number less than 1
statusReason: Error: expect(received).toBe(expected) // Object.is equality

Expected: "The number of guests must be greater than zero"
Received: "An unexpected error occurred"

[Killed] ConditionalExpression
src/domain/entities/booking.ts:89:13
             throw new Error('The number of guests must be greater than zero');
         }
         this.property.validateGuestCount(this.guestCount);
-        if (!this.property.isAvailable(this.dateRange)) {
+        if (true) {
             throw new Error('The property is unavailable in the date range requested');
         }
killedBy: BookingController should create a booking successfully
statusReason: Error: The property is unavailable in the date range requested

[Killed] BooleanLiteral
src/domain/entities/booking.ts:89:13
             throw new Error('The number of guests must be greater than zero');
         }
         this.property.validateGuestCount(this.guestCount);
-        if (!this.property.isAvailable(this.dateRange)) {
+        if (this.property.isAvailable(this.dateRange)) {
             throw new Error('The property is unavailable in the date range requested');
         }
killedBy: BookingController should create a booking successfully
statusReason: Error: The property is unavailable in the date range requested
