[Timeout] ArrayDeclaration
src/domain/entities/property.ts:6:44
 
 export class Property {
 
-    private readonly bookings: Booking[] = []
+    private readonly bookings: Booking[] = ["Stryker was here"]
     constructor(
         private id: string,

[Timeout] BlockStatement
src/domain/entities/property.ts:13:7
         private description: string,
         private maxGuests: number,
         private basePricePerNight: number,
-    ) {
-        this.id = id,
-        this.name = name,
-        this.description = description,
-        this.maxGuests = maxGuests,
-        this.basePricePerNight = basePricePerNight
-        this.validate();
-    }
+    ) {}
 
     getId(): string {

[Timeout] BlockStatement
src/domain/entities/property.ts:26:23
         return this.id;
     }
 
-    getName(): string {
-        return this.name;
-    }
+    getName(): string {}
 
     getDescription(): string {

[Timeout] BlockStatement
src/domain/entities/property.ts:30:30
         return this.name;
     }
 
-    getDescription(): string {
-        return this.description;
-    }
+    getDescription(): string {}
 
     getMaxGuests(): number {

[Timeout] BlockStatement
src/domain/entities/property.ts:34:28
         return this.description;
     }
 
-    getMaxGuests(): number {
-        return this.maxGuests;
-    }
+    getMaxGuests(): number {}
 
     getBasePricePerNight(): number {

[Timeout] BlockStatement
src/domain/entities/property.ts:38:36
         return this.maxGuests;
     }
 
-    getBasePricePerNight(): number {
-        return this.basePricePerNight;
-    }
+    getBasePricePerNight(): number {}
 
     validateGuestCount(guestCount: number): void {

[Killed] BlockStatement
src/domain/entities/property.ts:42:50
         return this.basePricePerNight;
     }
 
-    validateGuestCount(guestCount: number): void {
-        if (guestCount > this.maxGuests) {
-            throw new Error(`Number of guests exceeded. Maximum allowed: ${this.maxGuests}`)
-        }
-    }
+    validateGuestCount(guestCount: number): void {}
 
     calculateTotalPrice(dateRange: DateRange): number {
killedBy: Booking entity unit tests should throw an error when booking if guest count exceeds the maximum allowed
statusReason: Error: expect(received).toThrow(expected)

Expected substring: "Number of guests exceeded. Maximum allowed: 5"

Received function did not throw

[Killed] EqualityOperator
src/domain/entities/property.ts:43:13
     }
 
     validateGuestCount(guestCount: number): void {
-        if (guestCount > this.maxGuests) {
+        if (guestCount <= this.maxGuests) {
             throw new Error(`Number of guests exceeded. Maximum allowed: ${this.maxGuests}`)
         }
killedBy: BookingController should create a booking successfully
statusReason: error: the database system is starting up

[Killed] ConditionalExpression
src/domain/entities/property.ts:43:13
     }
 
     validateGuestCount(guestCount: number): void {
-        if (guestCount > this.maxGuests) {
+        if (true) {
             throw new Error(`Number of guests exceeded. Maximum allowed: ${this.maxGuests}`)
         }
killedBy: BookingController should create a booking successfully
statusReason: Error: Number of guests exceeded. Maximum allowed: 6

[Killed] StringLiteral
src/domain/entities/property.ts:44:29
 
     validateGuestCount(guestCount: number): void {
         if (guestCount > this.maxGuests) {
-            throw new Error(`Number of guests exceeded. Maximum allowed: ${this.maxGuests}`)
+            throw new Error(``)
         }
     }
killedBy: Booking entity unit tests should throw an error when booking if guest count exceeds the maximum allowed
statusReason: Error: expect(received).toThrow(expected)

Expected substring: "Number of guests exceeded. Maximum allowed: 5"
Received message:   ""

      109 |         } else {
      110 |           stryCov_9fa48("103");
    > 111 |           throw new Error(stryMutAct_9fa48("104") ? `` : (stryCov_9fa48("104"), `Number of guests exceeded. Maximum allowed: ${this.maxGuests}`));

[Timeout] BlockStatement
src/domain/entities/property.ts:48:55
         }
     }
 
-    calculateTotalPrice(dateRange: DateRange): number {
-        const totalNights = dateRange.getTotalNights();
-        let totalPrice = totalNights * this.basePricePerNight;
-        if (totalNights < 7) {
-            return totalPrice;
-        }
-        return totalPrice * 0.9;
-    }
+    calculateTotalPrice(dateRange: DateRange): number {}
 
     isAvailable(dateRange: DateRange): boolean {

[Killed] ArithmeticOperator
src/domain/entities/property.ts:50:26
 
     calculateTotalPrice(dateRange: DateRange): number {
         const totalNights = dateRange.getTotalNights();
-        let totalPrice = totalNights * this.basePricePerNight;
+        let totalPrice = totalNights / this.basePricePerNight;
         if (totalNights < 7) {
             return totalPrice;
killedBy: Booking entity unit tests should calculate the total price with discount
statusReason: Error: expect(received).toBe(expected) // Object.is equality

Expected: 2430
Received: 0.027

[Killed] EqualityOperator
src/domain/entities/property.ts:51:13
     calculateTotalPrice(dateRange: DateRange): number {
         const totalNights = dateRange.getTotalNights();
         let totalPrice = totalNights * this.basePricePerNight;
-        if (totalNights < 7) {
+        if (totalNights <= 7) {
             return totalPrice;
         }
killedBy: BookingController should create a booking successfully
statusReason: Error: thrown: "Exceeded timeout of 20000 ms for a hook.
Add a timeout value to this test to increase the timeout, if this is a long-running test. See https://jestjs.io/docs/api#testname-fn-timeout."

[Killed] EqualityOperator
src/domain/entities/property.ts:51:13
     calculateTotalPrice(dateRange: DateRange): number {
         const totalNights = dateRange.getTotalNights();
         let totalPrice = totalNights * this.basePricePerNight;
-        if (totalNights < 7) {
+        if (totalNights >= 7) {
             return totalPrice;
         }
killedBy: BookingController should create a booking successfully
statusReason: Error: thrown: "Exceeded timeout of 20000 ms for a hook.
Add a timeout value to this test to increase the timeout, if this is a long-running test. See https://jestjs.io/docs/api#testname-fn-timeout."

[Killed] ArithmeticOperator
src/domain/entities/property.ts:54:16
         if (totalNights < 7) {
             return totalPrice;
         }
-        return totalPrice * 0.9;
+        return totalPrice / 0.9;
     }
 
killedBy: Booking entity unit tests should calculate the total price with discount
statusReason: Error: expect(received).toBe(expected) // Object.is equality

Expected: 2430
Received: 3000

[Killed] BlockStatement
src/domain/entities/property.ts:57:48
         return totalPrice * 0.9;
     }
 
-    isAvailable(dateRange: DateRange): boolean {
-        return !this.bookings.some(
-            (booking) =>
-            booking.getStatus() === 'CONFIRMED' &&
-            booking.getDateRange().overlaps(dateRange)
-        );
-    }
+    isAvailable(dateRange: DateRange): boolean {}
 
     addBooking(booking: Booking): void {
killedBy: Booking entity unit tests should instantiate a booking with all attributes
statusReason: Error: The property is unavailable in the date range requested

[Killed] BooleanLiteral
src/domain/entities/property.ts:58:16
     }
 
     isAvailable(dateRange: DateRange): boolean {
-        return !this.bookings.some(
-            (booking) =>
-            booking.getStatus() === 'CONFIRMED' &&
-            booking.getDateRange().overlaps(dateRange)
-        );
+        return this.bookings.some(booking => booking.getStatus() === 'CONFIRMED' && booking.getDateRange().overlaps(dateRange));
     }
 
killedBy: Booking entity unit tests should instantiate a booking with all attributes
statusReason: Error: The property is unavailable in the date range requested

[Killed] MethodExpression
src/domain/entities/property.ts:58:17
     }
 
     isAvailable(dateRange: DateRange): boolean {
-        return !this.bookings.some(
-            (booking) =>
-            booking.getStatus() === 'CONFIRMED' &&
-            booking.getDateRange().overlaps(dateRange)
-        );
+        return !this.bookings.every(booking => booking.getStatus() === 'CONFIRMED' && booking.getDateRange().overlaps(dateRange));
     }
 
killedBy: BookingController should create a booking successfully
statusReason: Error: The property is unavailable in the date range requested

[Killed] ArrowFunction
src/domain/entities/property.ts:59:13
 
     isAvailable(dateRange: DateRange): boolean {
         return !this.bookings.some(
-            (booking) =>
-            booking.getStatus() === 'CONFIRMED' &&
-            booking.getDateRange().overlaps(dateRange)
+            () => undefined
         );
     }
killedBy: Property entity unit tests should validate property's availability for given dates
statusReason: Error: expect(received).toBe(expected) // Object.is equality

Expected: false
Received: true

[Killed] ConditionalExpression
src/domain/entities/property.ts:60:13
     isAvailable(dateRange: DateRange): boolean {
         return !this.bookings.some(
             (booking) =>
-            booking.getStatus() === 'CONFIRMED' &&
-            booking.getDateRange().overlaps(dateRange)
+            false
         );
     }
killedBy: Property entity unit tests should validate property's availability for given dates
statusReason: Error: expect(received).toBe(expected) // Object.is equality

Expected: false
Received: true

[Killed] EqualityOperator
src/domain/entities/property.ts:60:13
     isAvailable(dateRange: DateRange): boolean {
         return !this.bookings.some(
             (booking) =>
-            booking.getStatus() === 'CONFIRMED' &&
+            booking.getStatus() !== 'CONFIRMED' &&
             booking.getDateRange().overlaps(dateRange)
         );
killedBy: Property entity unit tests should validate property's availability for given dates
statusReason: Error: expect(received).toBe(expected) // Object.is equality

Expected: false
Received: true

[Killed] BlockStatement
src/domain/entities/property.ts:65:40
         );
     }
 
-    addBooking(booking: Booking): void {
-        this.bookings.push(booking);
-    }
+    addBooking(booking: Booking): void {}
 
     private validate(): void {
killedBy: BookingController should create a booking successfully
statusReason: error: the database system is starting up

[Timeout] BlockStatement
src/domain/entities/property.ts:69:30
         this.bookings.push(booking);
     }
 
-    private validate(): void {
-        if (!this.id) {
-            throw new Error(`The property's id is required`);
-        }
-        if (!this.name) {
-            throw new Error(`The property's name is required`);
-        }
-        if (!this.description) {
-            throw new Error(`The property's description is required`);
-        }
-        if (this.maxGuests <= 0) {
-            throw new Error('The maximum number of guests must be greater than zero');
-        }
-    }
+    private validate(): void {}
 }

[Killed] BlockStatement
src/domain/entities/property.ts:70:23
     }
 
     private validate(): void {
-        if (!this.id) {
-            throw new Error(`The property's id is required`);
-        }
+        if (!this.id) {}
         if (!this.name) {
             throw new Error(`The property's name is required`);
killedBy: Property entity unit tests should throw an error if id is empty
statusReason: Error: expect(received).toThrow(expected)

Expected substring: "The property's id is required"

Received function did not throw

[Timeout] ConditionalExpression
src/domain/entities/property.ts:70:13
     }
 
     private validate(): void {
-        if (!this.id) {
+        if (false) {
             throw new Error(`The property's id is required`);
         }

[Killed] StringLiteral
src/domain/entities/property.ts:71:29
 
     private validate(): void {
         if (!this.id) {
-            throw new Error(`The property's id is required`);
+            throw new Error(``);
         }
         if (!this.name) {
killedBy: Property entity unit tests should throw an error if id is empty
statusReason: Error: expect(received).toThrow(expected)

Expected substring: "The property's id is required"
Received message:   ""

      158 |         } else {
      159 |           stryCov_9fa48("128");
    > 160 |           throw new Error(stryMutAct_9fa48("129") ? `` : (stryCov_9fa48("129"), `The property's id is required`));

[Killed] BlockStatement
src/domain/entities/property.ts:73:25
         if (!this.id) {
             throw new Error(`The property's id is required`);
         }
-        if (!this.name) {
-            throw new Error(`The property's name is required`);
-        }
+        if (!this.name) {}
         if (!this.description) {
             throw new Error(`The property's description is required`);
killedBy: Property entity unit tests should throw an error if name is empty
statusReason: Error: expect(received).toThrow(expected)

Expected substring: "The property's name is required"

Received function did not throw

[Timeout] ConditionalExpression
src/domain/entities/property.ts:73:13
         if (!this.id) {
             throw new Error(`The property's id is required`);
         }
-        if (!this.name) {
+        if (false) {
             throw new Error(`The property's name is required`);
         }

[Killed] BlockStatement
src/domain/entities/property.ts:76:32
         if (!this.name) {
             throw new Error(`The property's name is required`);
         }
-        if (!this.description) {
-            throw new Error(`The property's description is required`);
-        }
+        if (!this.description) {}
         if (this.maxGuests <= 0) {
             throw new Error('The maximum number of guests must be greater than zero');
killedBy: Property entity unit tests should throw an error if description is empty
statusReason: Error: expect(received).toThrow(expected)

Expected substring: "The property's description is required"

Received function did not throw

[Timeout] ConditionalExpression
src/domain/entities/property.ts:76:13
         if (!this.name) {
             throw new Error(`The property's name is required`);
         }
-        if (!this.description) {
+        if (true) {
             throw new Error(`The property's description is required`);
         }

[Killed] BlockStatement
src/domain/entities/property.ts:79:34
         if (!this.description) {
             throw new Error(`The property's description is required`);
         }
-        if (this.maxGuests <= 0) {
-            throw new Error('The maximum number of guests must be greater than zero');
-        }
+        if (this.maxGuests <= 0) {}
     }
 }
killedBy: PropertyController should return an error if maxGuests is less than 1
statusReason: Error: expect(received).toBe(expected) // Object.is equality

Expected: 400
Received: 201

[Timeout] EqualityOperator
src/domain/entities/property.ts:79:13
         if (!this.description) {
             throw new Error(`The property's description is required`);
         }
-        if (this.maxGuests <= 0) {
+        if (this.maxGuests > 0) {
             throw new Error('The maximum number of guests must be greater than zero');
         }
