[Timeout] BlockStatement
src/domain/entities/user.ts:6:43
     private readonly id: string;
     private readonly name: string;
 
-    constructor(id: string, name: string) {
-        if (!name) {
-            throw new Error('User name is required');
-        }
-        if (!id) {
-            throw new Error('User id is required');
-        }
-        this.id = id;
-        this.name = name;
-    }
+    constructor(id: string, name: string) {}
 
     getId(): string {

[Killed] BlockStatement
src/domain/entities/user.ts:7:20
     private readonly name: string;
 
     constructor(id: string, name: string) {
-        if (!name) {
-            throw new Error('User name is required');
-        }
+        if (!name) {}
         if (!id) {
             throw new Error('User id is required');
killedBy: User entity unit tests should throw an error if name is empty
statusReason: Error: expect(received).toThrow(expected)

Expected substring: "User name is required"

Received function did not throw

[Timeout] ConditionalExpression
src/domain/entities/user.ts:7:13
     private readonly name: string;
 
     constructor(id: string, name: string) {
-        if (!name) {
+        if (true) {
             throw new Error('User name is required');
         }

[Killed] StringLiteral
src/domain/entities/user.ts:8:29
 
     constructor(id: string, name: string) {
         if (!name) {
-            throw new Error('User name is required');
+            throw new Error("");
         }
         if (!id) {
killedBy: User entity unit tests should throw an error if name is empty
statusReason: Error: expect(received).toThrow(expected)

Expected substring: "User name is required"
Received message:   ""

      59 |         } else {
      60 |           stryCov_9fa48("150");
    > 61 |           throw new Error(stryMutAct_9fa48("151") ? "" : (stryCov_9fa48("151"), 'User name is required'));

[Killed] BlockStatement
src/domain/entities/user.ts:10:18
         if (!name) {
             throw new Error('User name is required');
         }
-        if (!id) {
-            throw new Error('User id is required');
-        }
+        if (!id) {}
         this.id = id;
         this.name = name;
killedBy: User entity unit tests should throw an error if id is empty
statusReason: Error: expect(received).toThrow(expected)

Expected substring: "User id is required"

Received function did not throw

[Timeout] ConditionalExpression
src/domain/entities/user.ts:10:13
         if (!name) {
             throw new Error('User name is required');
         }
-        if (!id) {
+        if (true) {
             throw new Error('User id is required');
         }
