[Killed] BlockStatement
src/domain/value_objects/date_range.ts:5:49
     private readonly startDate: Date;
     private readonly endDate: Date;
 
-    constructor(startDate: Date, endDate: Date) {
-        this.validateDates(startDate, endDate);
-        this.startDate = startDate;
-        this.endDate = endDate;
-    }
+    constructor(startDate: Date, endDate: Date) {}
 
     getStartDate(): Date {
killedBy: BookingController should create a booking successfully
statusReason: TypeError: Cannot read properties of undefined (reading 'getTime')

[Killed] BlockStatement
src/domain/value_objects/date_range.ts:11:26
         this.endDate = endDate;
     }
 
-    getStartDate(): Date {
-        return this.startDate;
-    }
+    getStartDate(): Date {}
 
     getEndDate(): Date {
killedBy: BookingController should create a booking successfully
statusReason: Error: expect(received).toBe(expected) // Object.is equality

Expected: 201
Received: 400

[Killed] BlockStatement
src/domain/value_objects/date_range.ts:15:24
         return this.startDate;
     }
 
-    getEndDate(): Date {
-        return this.endDate;
-    }
+    getEndDate(): Date {}
 
     getTotalNights(): number {
killedBy: BookingController should create a booking successfully
statusReason: Error: expect(received).toBe(expected) // Object.is equality

Expected: 201
Received: 400

[Killed] BlockStatement
src/domain/value_objects/date_range.ts:19:30
         return this.endDate;
     }
 
-    getTotalNights(): number {
-        const diffTime = this.endDate.getTime() - this.startDate.getTime();
-        return Math.ceil(diffTime / (1000 * 3600 * 24));
-    }
+    getTotalNights(): number {}
 
     overlaps(other: DateRange): boolean {
killedBy: Booking entity unit tests should calculate the total price with discount
statusReason: Error: expect(received).toBe(expected) // Object.is equality

Expected: 2430
Received: NaN

[Killed] ArithmeticOperator
src/domain/value_objects/date_range.ts:20:26
     }
 
     getTotalNights(): number {
-        const diffTime = this.endDate.getTime() - this.startDate.getTime();
+        const diffTime = this.endDate.getTime() + this.startDate.getTime();
         return Math.ceil(diffTime / (1000 * 3600 * 24));
     }
killedBy: TypeORMBookingRepository should save a booking
statusReason: error: the database system is starting up

[Killed] ArithmeticOperator
src/domain/value_objects/date_range.ts:21:38
 
     getTotalNights(): number {
         const diffTime = this.endDate.getTime() - this.startDate.getTime();
-        return Math.ceil(diffTime / (1000 * 3600 * 24));
+        return Math.ceil(diffTime / (1000 * 3600 / 24));
     }
 
killedBy: Booking entity unit tests should calculate the total price with discount
statusReason: Error: expect(received).toBe(expected) // Object.is equality

Expected: 2430
Received: 1399680

[Killed] ArithmeticOperator
src/domain/value_objects/date_range.ts:21:38
 
     getTotalNights(): number {
         const diffTime = this.endDate.getTime() - this.startDate.getTime();
-        return Math.ceil(diffTime / (1000 * 3600 * 24));
+        return Math.ceil(diffTime / (1000 / 3600 * 24));
     }
 
killedBy: BookingController should create a booking successfully
statusReason: error: the database system is starting up

[Killed] BlockStatement
src/domain/value_objects/date_range.ts:24:41
         return Math.ceil(diffTime / (1000 * 3600 * 24));
     }
 
-    overlaps(other: DateRange): boolean {
-        return (
-            this.startDate  < other.getEndDate() && other.getStartDate() < this.endDate
-        )
-    }
+    overlaps(other: DateRange): boolean {}
 
     private validateDates(startDate: Date, endDate: Date): void {
killedBy: Property entity unit tests should validate property's availability for given dates
statusReason: Error: expect(received).toBe(expected) // Object.is equality

Expected: false
Received: true

[Killed] ConditionalExpression
src/domain/value_objects/date_range.ts:26:13
 
     overlaps(other: DateRange): boolean {
         return (
-            this.startDate  < other.getEndDate() && other.getStartDate() < this.endDate
+            false
         )
     }
killedBy: Property entity unit tests should validate property's availability for given dates
statusReason: Error: expect(received).toBe(expected) // Object.is equality

Expected: false
Received: true

[Killed] EqualityOperator
src/domain/value_objects/date_range.ts:26:53
 
     overlaps(other: DateRange): boolean {
         return (
-            this.startDate  < other.getEndDate() && other.getStartDate() < this.endDate
+            this.startDate  < other.getEndDate() && other.getStartDate() >= this.endDate
         )
     }
killedBy: Booking entity unit tests should not book when a property is unavailable
statusReason: Error: expect(received).toThrow(expected)

Expected substring: "The property is unavailable in the date range requested"

Received function did not throw

[Killed] BlockStatement
src/domain/value_objects/date_range.ts:30:65
         )
     }
 
-    private validateDates(startDate: Date, endDate: Date): void {
-        if (startDate == endDate) {
-            throw new Error('Start and end dates cannot be identical');
-        }
-        if (endDate < startDate) {
-            throw new Error('The end date must be greater than the start date');
-        }
-    }
+    private validateDates(startDate: Date, endDate: Date): void {}
 }
killedBy: TypeORMBookingRepository should save a booking
statusReason: error: the database system is starting up

[Killed] BlockStatement
src/domain/value_objects/date_range.ts:31:35
     }
 
     private validateDates(startDate: Date, endDate: Date): void {
-        if (startDate == endDate) {
-            throw new Error('Start and end dates cannot be identical');
-        }
+        if (startDate == endDate) {}
         if (endDate < startDate) {
             throw new Error('The end date must be greater than the start date');
killedBy: DateRange Value Object unit tests should throw an error when startDate equals endDate
statusReason: Error: expect(received).toThrow(expected)

Expected substring: "Start and end dates cannot be identical"

Received function did not throw

[Killed] ConditionalExpression
src/domain/value_objects/date_range.ts:31:13
     }
 
     private validateDates(startDate: Date, endDate: Date): void {
-        if (startDate == endDate) {
+        if (true) {
             throw new Error('Start and end dates cannot be identical');
         }
killedBy: BookingController should create a booking successfully
statusReason: error: the database system is starting up

[Killed] BlockStatement
src/domain/value_objects/date_range.ts:34:34
         if (startDate == endDate) {
             throw new Error('Start and end dates cannot be identical');
         }
-        if (endDate < startDate) {
-            throw new Error('The end date must be greater than the start date');
-        }
+        if (endDate < startDate) {}
     }
 }
killedBy: DateRange Value Object unit tests should throw an error if end date is before start date
statusReason: Error: expect(received).toThrow(expected)

Expected substring: "The end date must be greater than the start date"

Received function did not throw

[Killed] EqualityOperator
src/domain/value_objects/date_range.ts:34:13
         if (startDate == endDate) {
             throw new Error('Start and end dates cannot be identical');
         }
-        if (endDate < startDate) {
+        if (endDate >= startDate) {
             throw new Error('The end date must be greater than the start date');
         }
killedBy: TypeORMBookingRepository should save a booking
statusReason: Error: The end date must be greater than the start date
