[Killed] BlockStatement
infrastructure/persistence/mappers/booking_mapper.ts:9:74
 import { DateRange } from "../../../domain/value_objects/date_range";
 
 export class BookingMapper {
-    static toDomain(entity: BookingEntity, property?: Property): Booking {
-        const guest = UserMapper.toDomain(entity.guest);
-        const dateRange = new DateRange(entity.startDate, entity.endDate);
-
-        const booking = new Booking(
-            entity.id,
-            property || PropertyMapper.toDomain(entity.property),
-            guest,
-            dateRange,
-            entity.guestCount
-        );
-
-        booking['totalPrice'] = Number(entity.totalPrice);
-        booking['status'] = entity.status;
-
-        return booking;
-    }
+    static toDomain(entity: BookingEntity, property?: Property): Booking {}
 
     static toPersistence(domain: Booking): BookingEntity {
killedBy: BookingController should cancel a booking successfully
statusReason: Error: expect(received).toBe(expected) // Object.is equality

Expected: 200
Received: 400

[Killed] ConditionalExpression
infrastructure/persistence/mappers/booking_mapper.ts:15:13
 
         const booking = new Booking(
             entity.id,
-            property || PropertyMapper.toDomain(entity.property),
+            true,
             guest,
             dateRange,
killedBy: BookingController should cancel a booking successfully
statusReason: Error: expect(received).toBe(expected) // Object.is equality

Expected: 200
Received: 400

[Killed] ConditionalExpression
infrastructure/persistence/mappers/booking_mapper.ts:15:13
 
         const booking = new Booking(
             entity.id,
-            property || PropertyMapper.toDomain(entity.property),
+            false,
             guest,
             dateRange,
killedBy: BookingController should cancel a booking successfully
statusReason: Error: expect(received).toBe(expected) // Object.is equality

Expected: 200
Received: 400

[Killed] StringLiteral
infrastructure/persistence/mappers/booking_mapper.ts:22:17
         );
 
         booking['totalPrice'] = Number(entity.totalPrice);
-        booking['status'] = entity.status;
+        booking[""] = entity.status;
 
         return booking;
killedBy: TypeORMBookingRepository should save a booking and then canceling
statusReason: Error: expect(received).toBe(expected) // Object.is equality

Expected: "CANCELLED"
Received: "CONFIRMED"

[Killed] BlockStatement
infrastructure/persistence/mappers/booking_mapper.ts:27:58
         return booking;
     }
 
-    static toPersistence(domain: Booking): BookingEntity {
-        const entity = new BookingEntity();
-        entity.id = domain.getId();
-        entity.property = PropertyMapper.toPersistence(domain.getProperty());
-        entity.guest = UserMapper.toPersistence(domain.getGuest());
-        entity.startDate = domain.getDateRange().getStartDate();
-        entity.endDate = domain.getDateRange().getEndDate();
-        entity.guestCount = domain.getGuestCount();
-        entity.totalPrice = domain.getTotalPrice();
-        entity.status = domain.getStatus();
-
-        return entity;
-    }
+    static toPersistence(domain: Booking): BookingEntity {}
 }
killedBy: BookingController should create a booking successfully
statusReason: Error: expect(received).toBe(expected) // Object.is equality

Expected: 201
Received: 400
