[Killed] BlockStatement
src/infrastructure/repositories/fake_booking_repository.ts:7:49
 export class FakeBookingRepository implements BookingRepository {
     private bookings: Booking[] = [];
 
-    async save(booking: Booking): Promise<void> {
-        this.bookings.push(booking);
-    }
+    async save(booking: Booking): Promise<void> {}
     async findById(id: string): Promise<Booking | null> {
         return this.bookings.find((booking) => booking.getId() === id) || null;
killedBy: BookingService should create a booking using fake repository
statusReason: Error: expect(received).not.toBeNull()

Received: null

[Killed] BlockStatement
src/infrastructure/repositories/fake_booking_repository.ts:10:57
     async save(booking: Booking): Promise<void> {
         this.bookings.push(booking);
     }
-    async findById(id: string): Promise<Booking | null> {
-        return this.bookings.find((booking) => booking.getId() === id) || null;
-    }
+    async findById(id: string): Promise<Booking | null> {}
 }
killedBy: BookingService should create a booking using fake repository
statusReason: Error: expect(received).toBe(expected) // Object.is equality

Expected: "e196a3bb-d538-477e-bc10-8ece85afafcb"
Received: undefined

[Killed] ConditionalExpression
src/infrastructure/repositories/fake_booking_repository.ts:11:16
         this.bookings.push(booking);
     }
     async findById(id: string): Promise<Booking | null> {
-        return this.bookings.find((booking) => booking.getId() === id) || null;
+        return true;
     }
 }
killedBy: BookingService should create a booking using fake repository
statusReason: TypeError: savedBooking.getId is not a function

[Killed] ArrowFunction
src/infrastructure/repositories/fake_booking_repository.ts:11:35
         this.bookings.push(booking);
     }
     async findById(id: string): Promise<Booking | null> {
-        return this.bookings.find((booking) => booking.getId() === id) || null;
+        return this.bookings.find(() => undefined) || null;
     }
 }
killedBy: BookingService should create a booking using fake repository
statusReason: Error: expect(received).not.toBeNull()

Received: null
