[Killed] ArrayDeclaration
src/infrastructure/repositories/fake_property_repository.ts:5:38
 import { PropertyRepository } from "../../domain/repositories/property_repository";
 
 export class FakePropertyRepository implements PropertyRepository {
-    private properties: Property[] = [
-        new Property('1', 'Apartamento', 'Apartamento moderno', 4, 100),
-        new Property('2', 'Casa de Praia', 'Casa com vista para o mar', 6, 200)
-    ];
+    private properties: Property[] = [];
     async save(property: Property): Promise<void> {
         this.properties.push(property);
killedBy: PropertyService unit tests should return a property when a valid id is used
statusReason: Error: expect(received).not.toBeNull()

Received: null

[Killed] StringLiteral
src/infrastructure/repositories/fake_property_repository.ts:6:22
 
 export class FakePropertyRepository implements PropertyRepository {
     private properties: Property[] = [
-        new Property('1', 'Apartamento', 'Apartamento moderno', 4, 100),
+        new Property("", 'Apartamento', 'Apartamento moderno', 4, 100),
         new Property('2', 'Casa de Praia', 'Casa com vista para o mar', 6, 200)
     ];
killedBy: PropertyService unit tests should return null when invalid id is used
statusReason: Error: The property's id is required

[Killed] StringLiteral
src/infrastructure/repositories/fake_property_repository.ts:7:22
 export class FakePropertyRepository implements PropertyRepository {
     private properties: Property[] = [
         new Property('1', 'Apartamento', 'Apartamento moderno', 4, 100),
-        new Property('2', 'Casa de Praia', 'Casa com vista para o mar', 6, 200)
+        new Property("", 'Casa de Praia', 'Casa com vista para o mar', 6, 200)
     ];
     async save(property: Property): Promise<void> {
killedBy: PropertyService unit tests should return null when invalid id is used
statusReason: Error: The property's id is required

[Killed] StringLiteral
src/infrastructure/repositories/fake_property_repository.ts:7:44
 export class FakePropertyRepository implements PropertyRepository {
     private properties: Property[] = [
         new Property('1', 'Apartamento', 'Apartamento moderno', 4, 100),
-        new Property('2', 'Casa de Praia', 'Casa com vista para o mar', 6, 200)
+        new Property('2', 'Casa de Praia', "", 6, 200)
     ];
     async save(property: Property): Promise<void> {
killedBy: PropertyService unit tests should return null when invalid id is used
statusReason: Error: The property's description is required

[Killed] BlockStatement
src/infrastructure/repositories/fake_property_repository.ts:9:51
         new Property('1', 'Apartamento', 'Apartamento moderno', 4, 100),
         new Property('2', 'Casa de Praia', 'Casa com vista para o mar', 6, 200)
     ];
-    async save(property: Property): Promise<void> {
-        this.properties.push(property);
-    }
+    async save(property: Property): Promise<void> {}
     async findById(id: string): Promise<Property | null> {
         return this.properties.find((property) => property.getId() === id) || null;
killedBy: PropertyService unit tests should save a new property using a fake repository and return the data
statusReason: Error: expect(received).not.toBeNull()

Received: null

[Killed] BlockStatement
src/infrastructure/repositories/fake_property_repository.ts:12:58
     async save(property: Property): Promise<void> {
         this.properties.push(property);
     }
-    async findById(id: string): Promise<Property | null> {
-        return this.properties.find((property) => property.getId() === id) || null;
-    }
+    async findById(id: string): Promise<Property | null> {}
 }
killedBy: PropertyService unit tests should return null when invalid id is used
statusReason: Error: expect(received).toBeNull()

Received: undefined

[Killed] ConditionalExpression
src/infrastructure/repositories/fake_property_repository.ts:13:16
         this.properties.push(property);
     }
     async findById(id: string): Promise<Property | null> {
-        return this.properties.find((property) => property.getId() === id) || null;
+        return false;
     }
 }
killedBy: PropertyService unit tests should return null when invalid id is used
statusReason: Error: expect(received).toBeNull()

Received: false

[Killed] LogicalOperator
src/infrastructure/repositories/fake_property_repository.ts:13:16
         this.properties.push(property);
     }
     async findById(id: string): Promise<Property | null> {
-        return this.properties.find((property) => property.getId() === id) || null;
+        return this.properties.find(property => property.getId() === id) && null;
     }
 }
killedBy: PropertyService unit tests should return null when invalid id is used
statusReason: Error: expect(received).toBeNull()

Received: undefined
