[Killed] BlockStatement
infrastructure/persistence/mappers/property_mapper.ts:5:55
 import { PropertyEntity } from "../entities/property_entity";
 
 export class PropertyMapper {
-    static toDomain(entity: PropertyEntity): Property {
-        return new Property(
-            entity.id,
-            entity.name,
-            entity.description,
-            entity.maxGuests,
-            Number(entity.basePricePerNight)
-        );
-    }
+    static toDomain(entity: PropertyEntity): Property {}
 
     static toPersistence(domain: Property): PropertyEntity {
killedBy: BookingController should create a booking successfully
statusReason: Error: Property, Guest, and DateRange must be set before building a Booking

[Timeout] BlockStatement
infrastructure/persistence/mappers/property_mapper.ts:15:60
         );
     }
 
-    static toPersistence(domain: Property): PropertyEntity {
-        const entity = new PropertyEntity();
-        entity.id = domain.getId();
-        entity.name = domain.getName();
-        entity.description = domain.getDescription();
-        entity.maxGuests = domain.getMaxGuests();
-        entity.basePricePerNight = domain.getBasePricePerNight();
-        return entity;
-    }
+    static toPersistence(domain: Property): PropertyEntity {}
 }
