[Killed] BlockStatement
infrastructure/persistence/mappers/user_mappers.ts:5:47
 import { UserEntity } from "../entities/user_entity";
 
 export class UserMapper {
-    static toDomain(entity: UserEntity): User {
-        return new User(entity.id, entity.name);
-    }
+    static toDomain(entity: UserEntity): User {}
     
     static toPersistence(domain: User): UserEntity {
killedBy: TypeORMBookingRepository should save a booking
statusReason: TypeError: Cannot read properties of undefined (reading 'getId')

[Timeout] BlockStatement
infrastructure/persistence/mappers/user_mappers.ts:9:52
         return new User(entity.id, entity.name);
     }
     
-    static toPersistence(domain: User): UserEntity {
-        const entity = new UserEntity();
-        entity.id = domain.getId();
-        entity.name = domain.getName();
-        return entity;
-    }
+    static toPersistence(domain: User): UserEntity {}
 }
