[Killed] ArrayDeclaration
src/infrastructure/repositories/fake_user_repository.ts:5:29
 import { UserRepository } from "../../domain/repositories/user_repository";
 
 export class FakeUserRepository implements UserRepository {
-    private users: User[] = [
-        new User('1', 'Jhon Doe'),
-        new User('2', 'Jane Smith')
-    ];
+    private users: User[] = [];
 
     async findById(id: string): Promise<User | null> {
killedBy: User service unit tests should return an user when an user id valid is used
statusReason: Error: expect(received).not.toBeNull()

Received: null

[Killed] StringLiteral
src/infrastructure/repositories/fake_user_repository.ts:6:23
 
 export class FakeUserRepository implements UserRepository {
     private users: User[] = [
-        new User('1', 'Jhon Doe'),
+        new User('1', ""),
         new User('2', 'Jane Smith')
     ];
killedBy: User service unit tests should return null when an user id invalid is used
statusReason: Error: User name is required

[Killed] StringLiteral
src/infrastructure/repositories/fake_user_repository.ts:6:18
 
 export class FakeUserRepository implements UserRepository {
     private users: User[] = [
-        new User('1', 'Jhon Doe'),
+        new User("", 'Jhon Doe'),
         new User('2', 'Jane Smith')
     ];
killedBy: User service unit tests should return null when an user id invalid is used
statusReason: Error: User id is required

[Killed] BlockStatement
src/infrastructure/repositories/fake_user_repository.ts:10:54
         new User('2', 'Jane Smith')
     ];
 
-    async findById(id: string): Promise<User | null> {
-        return this.users.find((user) => user.getId() === id) || null;
-    }
+    async findById(id: string): Promise<User | null> {}
 
     async save(user: User) {
killedBy: User service unit tests should return null when an user id invalid is used
statusReason: Error: expect(received).toBeNull()

Received: undefined

[Killed] ConditionalExpression
src/infrastructure/repositories/fake_user_repository.ts:11:16
     ];
 
     async findById(id: string): Promise<User | null> {
-        return this.users.find((user) => user.getId() === id) || null;
+        return true;
     }
 
killedBy: User service unit tests should return null when an user id invalid is used
statusReason: Error: expect(received).toBeNull()

Received: true

[Killed] ConditionalExpression
src/infrastructure/repositories/fake_user_repository.ts:11:16
     ];
 
     async findById(id: string): Promise<User | null> {
-        return this.users.find((user) => user.getId() === id) || null;
+        return false;
     }
 
killedBy: User service unit tests should return null when an user id invalid is used
statusReason: Error: expect(received).toBeNull()

Received: false

[Killed] BlockStatement
src/infrastructure/repositories/fake_user_repository.ts:14:28
         return this.users.find((user) => user.getId() === id) || null;
     }
 
-    async save(user: User) {
-        this.users.push(user);
-    }
+    async save(user: User) {}
 }
killedBy: User service unit tests should save a new user using fake repository and return the data
statusReason: Error: expect(received).not.toBeNull()

Received: null
